<a href="https://colab.research.google.com/github/priyanshgupta1998/DATA_CM/blob/master/Index_set0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Indexing

indices are used for many purposes like :

1. Identification ( Each row has unique index)

2. selection   ( can select the perticular category from the feature)

In [0]:
import pandas as pd

In [56]:
drinks  = pd.read_csv('/home/drinks.csv')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0000
1,Albania,89,132,54,4.8675
2,Algeria,25,0,14,0.6903
3,Andorra,245,138,312,12.3015
4,Angola,217,57,45,5.6463

In [57]:
print(len(drinks))
print(drinks.shape)
print(drinks.ndim)

193
(193, 5)
2

In [58]:
drinks.index

RangeIndex(start=0, stop=193, step=1)

In [59]:
print(list(drinks.index))  # prints just first column , which is not the part of 'dataset'

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192]

In [60]:
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol'],
      dtype='object')

In [61]:
print(type(list(drinks.columns)))

<class 'list'>

In [62]:
drinks['country'].str.contains('Andorra').value_counts()   # True value for exactly No. of  occurance of a category in a fearture column.

False    192
True       1
Name: country, dtype: int64

In [63]:
drinks['country'].value_counts()  # frequency of a perticular country in the feature . # How many times it is coming .

Uruguay               1
Moldova               1
Afghanistan           1
Malaysia              1
Congo                 1
Guyana                1
Suriname              1
Albania               1
Uzbekistan            1
North Korea           1
Luxembourg            1
Angola                1
Malawi                1
Madagascar            1
El Salvador           1
Jordan                1
Niger                 1
Tajikistan            1
Australia             1
New Zealand           1
Timor-Leste           1
Sierra Leone          1
Zimbabwe              1
Cuba                  1
Japan                 1
Bhutan                1
Italy                 1
Cook Islands          1
Grenada               1
Kenya                 1
                     ..
Somalia               1
Bulgaria              1
Papua New Guinea      1
Mongolia              1
Botswana              1
Netherlands           1
Cambodia              1
St. Kitts & Nevis     1
Slovenia              1
Togo                  1
Denmark               1
Argentina             1
Paraguay              1
Dominica              1
Ethiopia              1
Cyprus                1
Monaco                1
Mauritius             1
Czech Republic        1
Austria               1
United Kingdom        1
Cote d'Ivoire         1
Zambia                1
Latvia                1
Ghana                 1
Djibouti              1
Russian Federation    1
Romania               1
Peru                  1
Rwanda                1
Name: country, Length: 193, dtype: int64

In [64]:
drinks[drinks.country	=='Andorra']

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
3,Andorra,245,138,312,12.3015

In [65]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0000
1,Albania,89,132,54,4.8675
2,Algeria,25,0,14,0.6903
3,Andorra,245,138,312,12.3015
4,Angola,217,57,45,5.6463

In [66]:
drinks.loc[3,'wine_servings']

312

In [0]:
drinks.set_index('country',inplace=True)   # Set 'country' coulmn as a index of each row in the dataframe

In [68]:
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
country,,,,
Afghanistan,0,0,0,0.0000
Albania,89,132,54,4.8675
Algeria,25,0,14,0.6903
Andorra,245,138,312,12.3015
Angola,217,57,45,5.6463

In [69]:
drinks.loc['Andorra','wine_servings']

312

In [70]:
drinks.index   # Now country names are being shown as an index    # But length is same as previous.

Index(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua & Barbuda', 'Argentina', 'Armenia', 'Australia', 'Austria',
       ...
       'United Kingdom', 'Uruguay', 'USA', 'Uzbekistan', 'Vanuatu',
       'Venezuela', 'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype='object', name='country', length=193)

In [71]:
drinks.columns   # Now we have Only 4 column in our Dataframe.

Index(['beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol'],
      dtype='object')

In [72]:
drinks.shape

(193, 4)

In [73]:
drinks.head()  #New dataframe

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
country,,,,
Afghanistan,0,0,0,0.0000
Albania,89,132,54,4.8675
Algeria,25,0,14,0.6903
Andorra,245,138,312,12.3015
Angola,217,57,45,5.6463

In [75]:
drinks.index.name = None   # Remove the title of the index column
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
Afghanistan,0,0,0,0.0000
Albania,89,132,54,4.8675
Algeria,25,0,14,0.6903
Andorra,245,138,312,12.3015
Angola,217,57,45,5.6463

#To Add ONE NEW COLUMN IN THE DATAFRAME

In [76]:
drinks.index.name = 'Desh'  # Now we have again 5 column 
drinks.reset_index(inplace =True)
drinks.head()

,Desh,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0000
1,Albania,89,132,54,4.8675
2,Algeria,25,0,14,0.6903
3,Andorra,245,138,312,12.3015
4,Angola,217,57,45,5.6463

In [77]:
drinks.shape

(193, 5)

In [78]:
drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,105.906736,81.875648,49.958549,4.208015
std,101.204988,89.128390,80.019062,3.744655
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,0.796500
50%,71.000000,56.000000,8.000000,3.009000
75%,188.000000,131.000000,62.000000,6.991500
max,376.000000,438.000000,370.000000,13.328100

In [79]:
drinks.describe().index

Index(['count', 'mean', 'std', 'min', '25%', '50%', '75%', 'max'], dtype='object')

In [80]:
drinks.describe().columns

Index(['beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol'],
      dtype='object')

In [81]:
drinks.describe().loc['25%','spirit_servings']

4.0

In [27]:
df = pd.read_csv('/home/tmdb_5000_movies.csv')
df.head()

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-19,961000000,169.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""...",2015-10-26,880674609,148.0,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466
3,250000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 80, ""nam...",http://www.thedarkknightrises.com/,49026,"[{""id"": 849, ""name"": ""dc comics""}, {""id"": 853,...",en,The Dark Knight Rises,Following the death of District Attorney Harve...,112.312950,"[{""name"": ""Legendary Pictures"", ""id"": 923}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-07-16,1084939099,165.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,The Legend Ends,The Dark Knight Rises,7.6,9106
4,260000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://movies.disney.com/john-carter,49529,"[{""id"": 818, ""name"": ""based on novel""}, {""id"":...",en,John Carter,"John Carter is a war-weary, former military ca...",43.926995,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}]","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-03-07,284139100,132.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"Lost in our world, found in another.",John Carter,6.1,2124

In [29]:
print(len(df))
print(df.shape)

4803
(4803, 20)